# 전략명 → menu_code 매핑 테이블
STRATEGY_NAME_TO_CODE = {
    "장중-신용현금-매도": "0",
    "장중-현금-매도": "2",
    "시간외-현금-매도": "7",
    "장중-신용-매도": "12",
    "장중-신용-매도-무한반복": "12-1",
    "장중-신용-신규매수": "13",
    "장중-신용-물타기-매수": "14",
    "시간외NXT-신용현금-매도": "16",
    "시간외-신용-매도": "17",
    "장마감-신용-매도": "18",
    "시간외-신용현금-매도": "22",
    "미체결-현금매도-KRX-취소": "30",
    "미체결-현금매도-NXT-취소": "31",
    "미체결-신용매도-KRX-취소": "32",
    "미체결-신용매도-NXT-취소": "33",
    "미체결-신용매도-ALL-취소": "41",
    "미체결-현금신용매도-ALL-취소": "34",
    "미체결-신용매도-NOTNXT종목-취소": "35",
    "미체결-신용매도-NXT종목-취소": "42",
    "미체결-현금신용매수-ALL-취소": "40",
    "잔고-내역-저장": "200",
    "매도주문-내역-삭제": "201",
    "추가매수-미체결-매도-취소": "202"
    # 필요시 추가 전략명:코드 쌍을 여기에 계속 추가
}

'''
STRATEGY_NAME_TO_CODE = {
    "장중-신용현금-매도": "0",
    "자동-물타기-매수": "1",
    "장중-현금-매도": "2",
    "장중-현금-신규-매수": "3",
    "수동-매도": "4",
    "수동-물타기-매수": "5",
    "시간외-현금-매도": "7",
    "장중-신용-매도": "12",
    "장중-신용-매도-무한반복": "12-1",
    "장중-신용-신규매수": "13",
    "장중-신용-물타기-매수": "14",
    "시간외NXT-신용현금-매도": "16",
    "시간외-신용-매도": "17",
    "장마감-신용-매도": "18",
    "시간외-신용현금-매도": "22",
    "미체결-현금매도-KRX-취소": "30",
    "미체결-현금매도-NXT-취소": "31",
    "미체결-신용매도-KRX-취소": "32",
    "미체결-신용매도-NXT-취소": "33",
    "미체결-신용매도-ALL-취소": "41",
    "미체결-현금신용매도-ALL-취소": "34",
    "미체결-신용매도-NOTNXT종목-취소": "35",
    "미체결-신용매도-NXT종목-취소": "42",
    "미체결-현금매수-KRX-취소": "36",
    "미체결-현금매수-NXT-취소": "37",
    "미체결-신용매수-KRX-취소": "38",
    "미체결-신용매수-NXT-취소": "39",
    "미체결-현금신용매수-ALL-취소": "40"
    "잔고-조회": "100",
    "신용잔고-조회": "101"
    # 필요시 추가 전략명:코드 쌍을 여기에 계속 추가
}
'''
